app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      @songs = Artist.find(:artist_id).songs
      if @artist.nil?
        flash[:alert] = "Artist not found"
        redirect_to artists_path
      else
        @songs = @artist.songs
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"